ДемоПримерыОбменов/src/DataProcessors/ВыгрузкаЗагрузкаXML/ВыгрузкаЗагрузкаXML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаЗагрузкаXML</name>
</mdclass:DataProcessor>

ДемоПримерыОбменов/src/InformationRegisters/ДатыБронирований/ДатыБронирований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыБронирований</name>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДемоПримерыОбменов/src/DataProcessors/ВыгрузкаЗагрузкаXML/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьXDTO(Команда)
	ВыгрузитьXDTOНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьXDTO(Команда)
	ЗагрузитьXDTOНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьXML(Команда)
	ВыгрузитьXMLНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьXML(Команда)
	ЗагрузитьXMLНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура Очистить(Команда)
	
	ТекстВопроса = "Все данные в подсистеме Бронирования будут удалены. Продолжить?";
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ВОзврат;
	КонецЕсли;
	
	ОчиститьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспериментБыстродействие(Команда)
	ЭкспериментБыстродействиеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьDOM(Команда)
	ВыгрузитьDOMНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьDOM(Команда)
	ЗагрузитьDOMНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьXDTOНаСервере()
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	
	ТипЭкспортируемыеДанные = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "exportData");
	ЭкспортируемыеДанныеXDTO = ФабрикаXDTO.Создать(ТипЭкспортируемыеДанные);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номера.Ссылка)) КАК Идентификатор,
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование,
		|	Номера.Описание КАК Описание
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипСписокНомеров = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "rooms");
	СписокНомеровXDTO = ФабрикаXDTO.Создать(ТипСписокНомеров);
	
	Пока Выборка.Следующий() Цикл
		
		ТипОписаниеНомера = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "room");
		ОписаниеНомераXDTO = ФабрикаXDTO.Создать(ТипОписаниеНомера);
		
		ОписаниеНомераXDTO.id = Выборка.Идентификатор;
		ОписаниеНомераXDTO.code = Выборка.Код;
		ОписаниеНомераXDTO.name = Выборка.Наименование;
		ОписаниеНомераXDTO.description = Выборка.Описание;
		
		СписокНомеровXDTO.room.Добавить(ОписаниеНомераXDTO)
		
	КонецЦикла;
	
	ЭкспортируемыеДанныеXDTO.rooms = СписокНомеровXDTO;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДатыБронирований.Номер)) КАК ИдентификаторНомера,
		|	ДатыБронирований.ДатаНачала КАК ДатаНачала,
		|	ДатыБронирований.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ДатыБронирований КАК ДатыБронирований";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипСписокБронирований = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "books");
	СписокБронированийXDTO = ФабрикаXDTO.Создать(ТипСписокБронирований);
		
	Пока Выборка.Следующий() Цикл
		
		ТипОписаниеБронирования = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "book");
		ОписаниеБронированияXDTO = ФабрикаXDTO.Создать(ТипОписаниеБронирования);
		
		ОписаниеБронированияXDTO.roomId = Выборка.ИдентификаторНомера;
		ОписаниеБронированияXDTO.startDate = Выборка.ДатаНачала;
		ОписаниеБронированияXDTO.endDate = Выборка.ДатаОкончания;
		
		СписокБронированийXDTO.book.Добавить(ОписаниеБронированияXDTO)
		
	КонецЦикла;
	
	ЭкспортируемыеДанныеXDTO.books = СписокБронированийXDTO;
	
	ФабрикаXDTO.ЗаписатьXML(Запись, ЭкспортируемыеДанныеXDTO);
	
	ДанныеXML = Запись.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьXDTOНаСервере()
	
	Чтение = Новый ЧтениеXML();
	Чтение.УстановитьСтроку(ДанныеXML);
	
	ТипЭкспортируемыеДанные = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "exportData");
	ЭкспортируемыеДанные = ФабрикаXDTO.ПрочитатьXML(Чтение, ТипЭкспортируемыеДанные);
	
	Чтение.Закрыть();
	
	Для Каждого ДанныеНомера Из ЭкспортируемыеДанные.rooms.room Цикл
		
		// Нормализация данных
		Идентификатор = ПолучитьИдентификаторИзСтроки(ДанныеНомера.id);
		
		Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
		
		СпрОбъект = Ссылка.ПолучитьОбъект();
		Если СпрОбъект = Неопределено Тогда
			СпрОбъект = Справочники.Номера.СоздатьЭлемент();
			СпрОбъект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
		СпрОбъект.Код = ДанныеНомера.code;
		СпрОбъект.Наименование = ДанныеНомера.name;
		СпрОбъект.Описание = ДанныеНомера.description;
		СпрОбъект.Записать();
		
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьXMLНаСервере()
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	
	// Начало записи тела выгрузки	
	Запись.ЗаписатьНачалоЭлемента("exportData");
	Запись.ЗаписатьСоответствиеПространстваИмен("", "http://narfu.ru/151315/booking");
	Запись.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
	Запись.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	
	// Начало записи списка комнат
	Запись.ЗаписатьНачалоЭлемента("rooms");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номера.Ссылка)) КАК Идентификатор,
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование,
		|	Номера.Описание КАК Описание
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("room");
		Запись.ЗаписатьАтрибут("id", Выборка.Идентификатор);
		
		Запись.ЗаписатьНачалоЭлемента("name");
		Запись.ЗаписатьТекст(Выборка.Наименование);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("code");
		Запись.ЗаписатьТекст(Выборка.Код);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("description");
		Запись.ЗаписатьТекст(Выборка.Описание);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьКонецЭлемента(); // room
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); // rooms
	//
	// Начало записи списка бронирований
	Запись.ЗаписатьНачалоЭлемента("books");	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДатыБронирований.Номер)) КАК ИдентификаторНомера,
		|	ДатыБронирований.ДатаНачала КАК ДатаНачала,
		|	ДатыБронирований.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ДатыБронирований КАК ДатыБронирований";
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("book");	
		
		Запись.ЗаписатьНачалоЭлемента("roomId");
		Запись.ЗаписатьТекст(Выборка.ИдентификаторНомера);
		Запись.ЗаписатьКонецЭлемента();		

		ТипЗначения = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "date");
		ОбъектДата = ФабрикаXDTO.Создать(ТипЗначения, Выборка.ДатаНачала);
		ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектДата, "startDate", "http://narfu.ru/151315/booking");
		
		ТипЗначения = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "date");
		ОбъектДата = ФабрикаXDTO.Создать(ТипЗначения, Выборка.ДатаОкончания);
		ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектДата, "endDate", "http://narfu.ru/151315/booking");
		
		Запись.ЗаписатьКонецЭлемента(); // book
	
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); // books
	
	// Завершение записи тела выгрузки
	Запись.ЗаписатьКонецЭлемента();
	
	ДанныеXML = Запись.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьXMLНаСервере()

	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ДанныеXML);
		
	Если Не Чтение.Прочитать() Тогда
		ВызватьИсключение "Неожиданный конец XML файла";
	КонецЕсли;
	
	Если Не (Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И Чтение.Имя = "exportData") Тогда
		ВызватьИсключение "Ожидается начало элемента exportData";
	КонецЕсли;
	
	Если Не Чтение.Прочитать() Тогда
		ВызватьИсключение "Неожиданный конец XML файла";
	КонецЕсли;
	
	Если Не (Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И Чтение.Имя = "rooms") Тогда
		ВызватьИсключение "Ожидается начало элемента rooms";
	КонецЕсли;
	
	ЗагрузитьСписокКомнат(Чтение);
	
	ЗагрузитьСписокБронирований(Чтение);
	
	Чтение.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьDOMНаСервере()
	
	Документ = Новый ДокументDOM("http://narfu.ru/151315/booking", "exportData");
	
	СписокКомнат = Документ.СоздатьЭлемент("rooms");
	Документ.ЭлементДокумента.ДобавитьДочерний(СписокКомнат);
	
	Документ.ЭлементДокумента.УстановитьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
	Документ.ЭлементДокумента.УстановитьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номера.Ссылка)) КАК Идентификатор,
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование,
		|	Номера.Описание КАК Описание
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Комната = Документ.СоздатьЭлемент("room");
		Комната.УстановитьАтрибут("id", Выборка.Идентификатор);
		
		ЭлементНаименование = Документ.СоздатьЭлемент("name");
		ЭлементНаименование.ТекстовоеСодержимое = Выборка.Наименование;
		Комната.ДобавитьДочерний(ЭлементНаименование);
		
		ЭлементКод = Документ.СоздатьЭлемент("code");
		ЭлементКод.ТекстовоеСодержимое = Выборка.Код;
		Комната.ДобавитьДочерний(ЭлементКод);
		
		ЭлементОписание = Документ.СоздатьЭлемент("description");
		ЭлементОписание.ТекстовоеСодержимое = Выборка.Описание;
		Комната.ДобавитьДочерний(ЭлементОписание);
		
		СписокКомнат.ДобавитьДочерний(Комната);
		
	КонецЦикла;

	СписокБронирований = Документ.СоздатьЭлемент("books");
	Документ.ЭлементДокумента.ДобавитьДочерний(СписокБронирований);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДатыБронирований.Номер)) КАК ИдентификаторНомера,
		|	ДатыБронирований.ДатаНачала КАК ДатаНачала,
		|	ДатыБронирований.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ДатыБронирований КАК ДатыБронирований";
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Бронирование = Документ.СоздатьЭлемент("book");
		
		ЭлементИдентификаторКомнаты = Документ.СоздатьЭлемент("roomId");
		ЭлементИдентификаторКомнаты.ТекстовоеСодержимое = Выборка.ИдентификаторНомера;
		Бронирование.ДобавитьДочерний(ЭлементИдентификаторКомнаты);
		
		ЭлементИдентификаторКомнаты = Документ.СоздатьЭлемент("startDate");
		ЭлементИдентификаторКомнаты.ТекстовоеСодержимое = ДатаДляXML(Выборка.ДатаНачала);
		Бронирование.ДобавитьДочерний(ЭлементИдентификаторКомнаты);
		
		ЭлементИдентификаторКомнаты = Документ.СоздатьЭлемент("endDate");
		ЭлементИдентификаторКомнаты.ТекстовоеСодержимое = ДатаДляXML(Выборка.ДатаОкончания);
		Бронирование.ДобавитьДочерний(ЭлементИдентификаторКомнаты);
		
		СписокБронирований.ДобавитьДочерний(Бронирование);
	
	КонецЦикла;	
	
	ЗаписьDOM = Новый ЗаписьDOM();
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	ЗаписьDOM.Записать(Документ, Запись);
	ДанныеXML = Запись.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьDOMНаСервере()
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ДанныеXML);
	
	Построитель = Новый ПостроительDOM();
	Дерево = Построитель.Прочитать(Чтение);
	
	Для Каждого Список Из Дерево.ЭлементДокумента.ДочерниеУзлы Цикл
		Если Список.ИмяУзла = "rooms" Тогда
			ЗагрузитьКомнаты(Список);
		КонецЕсли;
		Если Список.ИмяУзла = "books" Тогда
			ЗагрузитьБронирования(Список);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКомнаты(Список)
	
	Для Каждого Комната Из Список.ДочерниеУзлы Цикл
		
		ИдентификаторСтрока = Комната.Атрибуты.ПолучитьИменованныйЭлемент("id").Значение;
		Код = "";
		Наименование = "";
		Описание = "";
		
		Для Каждого РеквизитКомнаты Из Комната.ДочерниеУзлы Цикл
			Если РеквизитКомнаты.ИмяУзла = "code" Тогда
				Код = РеквизитКомнаты.ТекстовоеСодержимое;
			КонецЕсли;
			Если РеквизитКомнаты.ИмяУзла = "name" Тогда
				Наименование = РеквизитКомнаты.ТекстовоеСодержимое;
			КонецЕсли;
			Если РеквизитКомнаты.ИмяУзла = "description" Тогда
				Описание = РеквизитКомнаты.ТекстовоеСодержимое;
			КонецЕсли;
		КонецЦикла;
		
		// Нормализация данных
		Идентификатор = ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока);
		
		Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
		
		СпрОбъект = Ссылка.ПолучитьОбъект();
		Если СпрОбъект = Неопределено Тогда
			СпрОбъект = Справочники.Номера.СоздатьЭлемент();
			СпрОбъект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
		СпрОбъект.Код = Код;
		СпрОбъект.Наименование = Наименование;
		СпрОбъект.Описание = Описание;
		СпрОбъект.Записать();	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьБронирования(Список)
	
	НаборЗаписей = РегистрыСведений.ДатыБронирований.СоздатьНаборЗаписей();
	
	Для Каждого Бронирование Из Список.ДочерниеУзлы Цикл
		
		ИдентификаторКомнаты = "";
		ДатаНачала = "";		
		ДатаОкончания = "";
		
		Для Каждого РеквизитКомнаты Из Бронирование.ДочерниеУзлы Цикл
			Если РеквизитКомнаты.ИмяУзла = "roomId" Тогда
				ИдентификаторКомнаты = РеквизитКомнаты.ТекстовоеСодержимое;
			КонецЕсли;
			Если РеквизитКомнаты.ИмяУзла = "startDate" Тогда
				ДатаНачала = РеквизитКомнаты.ТекстовоеСодержимое;
			КонецЕсли;
			Если РеквизитКомнаты.ИмяУзла = "endDate" Тогда
				ДатаОкончания = РеквизитКомнаты.ТекстовоеСодержимое;
			КонецЕсли;
		КонецЦикла;
	
		// Нормализация данных
		Идентификатор = ПолучитьИдентификаторИзСтроки(ИдентификаторКомнаты);
		
		Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Номер = Ссылка;
		Запись.ДатаНачала = XMLЗначение(Тип("Дата"), ДатаНачала);
		Запись.ДатаОкончания = XMLЗначение(Тип("Дата"), ДатаОкончания);
		
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);	
	
КонецПроцедуры

&НаСервере
Функция ДатаДляXML(Дата)
	
	Возврат Формат(Дата, "ДФ=гггг-ММ-дд;");
	
КонецФункции

// Читает данные из узла XML и создает или обновляет элементы справочника Номера.
//
// Параметры:
//   ЧтениеXML - ЧтениеXML - Объект чтения XML, установленный на узел с атрибутом id
&НаСервере
Процедура ЗагрузитьСписокКомнат(ЧтениеXML)
	
	Если Не (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И ЧтениеXML.Имя = "rooms") Тогда
		ВызватьИсключение "Ожидается начало элемента rooms";
	КонецЕсли;
	
	Если Не ЧтениеXML.Прочитать() Тогда
		ВызватьИсключение "Неожиданный конец XML файла";
	КонецЕсли;
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И ЧтениеXML.Имя = "room"  Цикл
		
		ПрочитатьНомерИзXML(ЧтениеXML);
		
	КонецЦикла;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Если Не ЧтениеXML.Прочитать() Тогда
			ВызватьИсключение "Неожиданный конец XML файла";
		КонецЕсли;
	Иначе
		ВызватьИсключение "Ожидается конец элемента rooms";		
	КонецЕсли;	
	
КонецПроцедуры

// Читает данные из узла XML и создает или обновляет элемент справочника Номера.
//
// Параметры:
//   ЧтениеXML - ЧтениеXML - Объект чтения XML, установленный на узел с атрибутом id
&НаСервере
Процедура ПрочитатьНомерИзXML(ЧтениеXML)
	
	ТипТипКомната = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "room");
	ДанныеНомера = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипТипКомната);
	
	// Нормализация данных
	Идентификатор = ПолучитьИдентификаторИзСтроки(ДанныеНомера.id);
	
	Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
	
	СпрОбъект = Ссылка.ПолучитьОбъект();
	Если СпрОбъект = Неопределено Тогда
		СпрОбъект = Справочники.Номера.СоздатьЭлемент();
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	СпрОбъект.Код = ДанныеНомера.code;
	СпрОбъект.Наименование = ДанныеНомера.name;
	СпрОбъект.Описание = ДанныеНомера.description;
	СпрОбъект.Записать();
	
	Возврат;
	
	Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
		ВызватьИсключение "Ожидается начало элемента room";
	КонецЕсли;
	
	Если ЧтениеXML.Имя <> "room" Тогда
		ВызватьИсключение "Ожидается начало элемента room";
	КонецЕсли;
		
	ИдентификаторСтрока = ЧтениеXML.ПолучитьАтрибут("id");
	Наименование = "";
	Код = "";
	Описание = "";
	
	// Читаем наименование
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Наименование = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	// Читаем код
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Код = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	// Читаем описание
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Описание = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	// Нормализация данных
	Идентификатор = ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока);
	
	Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
	
	СпрОбъект = Ссылка.ПолучитьОбъект();
	Если СпрОбъект = Неопределено Тогда
		СпрОбъект = Справочники.Номера.СоздатьЭлемент();
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	СпрОбъект.Код = Код;
	СпрОбъект.Наименование = Наименование;
	СпрОбъект.Описание = Описание;
	СпрОбъект.Записать();
	
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();	
	
КонецПроцедуры

// Читает данные из узла XML и создает или обновляет набор записей бронирования.
//
// Параметры:
//   ЧтениеXML - ЧтениеXML - Объект чтения XML, установленный на узел с атрибутом books
&НаСервере
Процедура ЗагрузитьСписокБронирований(ЧтениеXML)
	
	Если Не (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И ЧтениеXML.Имя = "books") Тогда
		ВызватьИсключение "Ожидается начало элемента books";
	КонецЕсли;
	
	Если Не ЧтениеXML.Прочитать() Тогда
		ВызватьИсключение "Неожиданный конец XML файла";
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДатыБронирований.СоздатьНаборЗаписей();
	
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
		И ЧтениеXML.Имя = "book"  Цикл
		
		ПрочитатьБронированиеИзXML(ЧтениеXML, НаборЗаписей);
		
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Если Не ЧтениеXML.Прочитать() Тогда
			ВызватьИсключение "Неожиданный конец XML файла";
		КонецЕсли;
	Иначе
		ВызватьИсключение "Ожидается конец элемента books";		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьБронированиеИзXML(ЧтениеXML, НаборЗаписей)
	
	Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
		ВызватьИсключение "Ожидается начало элемента book";
	КонецЕсли;
	
	Если ЧтениеXML.Имя <> "book" Тогда
		ВызватьИсключение "Ожидается начало элемента book";
	КонецЕсли;
	
	ИдентификаторКомнаты = "";
	ДатаНачала = "";
	ДатаОкончания = "";
	
	// Читаем идентификатор комнаты
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		ИдентификаторКомнаты = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	// Читаем дату начала
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		ДатаНачала = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	// Читаем дату окончания
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		ДатаОкончания = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	// Нормализация данных
	Идентификатор = ПолучитьИдентификаторИзСтроки(ИдентификаторКомнаты);
	
	Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.Номер = Ссылка;
	Запись.ДатаНачала = XMLЗначение(Тип("Дата"), ДатаНачала);
	Запись.ДатаОкончания = XMLЗначение(Тип("Дата"), ДатаОкончания);
	
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	
КонецПроцедуры


&НаСервере
Функция ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока)
	
	// Стандартный шаблон uuid
	Шаблон = "[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}";
	
	Если СтрПодобнаПоРегулярномуВыражению(ИдентификаторСтрока, Шаблон, Истина) Тогда
		Возврат Новый УникальныйИдентификатор(ИдентификаторСтрока);
	КонецЕсли;
	
	ВызватьИсключение "Некорректный идентификатор";
	
КонецФункции

&НаСервере
Процедура ОчиститьНаСервере()
	ОбработкаДанных.ОчиститьДанныеПодсистемыБронирований()
КонецПроцедуры

&НаСервере
Процедура ЭкспериментБыстродействиеНаСервере()
	
	Дата = ТекущаяДатаСеанса();
	
	НачалоЗамераФормат = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	
	Запись.ЗаписатьНачалоЭлемента("body");
	
	Для Сч = 1 По 100000 Цикл
		Запись.ЗаписатьНачалоЭлемента("startDate");
		Запись.ЗаписатьТекст(Формат(Дата, "ДФ=гггг-ММ-дд;"));
		Запись.ЗаписатьКонецЭлемента();		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();	// body
	
	Результат = Запись.Закрыть();
	
	Запись = Неопределено;
	Результат = Неопределено;
	
	Сообщить("Через формат: " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамераФормат));
	
	НачалоЗамераXDTO = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	
	Запись.ЗаписатьНачалоЭлемента("body");
	
	Для Сч = 1 По 100000 Цикл
		ТипЗначения = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "date");
		ОбъектДата = ФабрикаXDTO.Создать(ТипЗначения, Дата);
		ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектДата, "startDate", "http://narfu.ru/151315/booking");
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();	// body
	
	Результат = Запись.Закрыть();
	
	Запись = Неопределено;
	Результат = Неопределено;
	
	Сообщить("Через XDTO: " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамераXDTO));

КонецПроцедуры

#КонецОбласти
